package kadai_008;

public class Price_Chapter08 {
	public static void main(String[] args) {
		int userAge = (int)(Math.random() * 100);
		String age = "";
		age = switch(userAge) {
		case 10, 11, 12, 13, 14, 15, 16, 17, 18, 19 -> "10代の";
		case 20, 21, 22, 23, 24, 25, 26, 27, 28, 29 -> "20代の";
		case 30, 31, 32, 33, 34, 35, 36, 37, 38, 39 -> "30代の";
		case 40, 41, 42, 43, 44, 45, 46, 47, 48, 49 -> "40代の";
		case 50, 51, 52, 53, 54, 55, 56, 57, 58, 59 -> "50代の";
		case 60, 61, 62, 63, 64, 65, 66, 67, 68, 69 -> "60代の";
		case 70, 71, 72, 73, 74, 75, 76, 77, 78, 79 -> "70代の";
		case 80, 81, 82, 83, 84, 85, 86, 87, 88, 89 -> "80代の";
		default -> "上記以外の年代の";
		};
		int serviceCost = (userAge);
		String cost = "";
		cost = switch(serviceCost) {
		case 10, 11, 12, 13, 14, 15, 16, 17, 18, 19 -> "料金は1000円";
		case 20, 21, 22, 23, 24, 25, 26, 27, 28, 29 -> "料金は2000円";
		case 30, 31, 32, 33, 34, 35, 36, 37, 38, 39 -> "料金は3000円";
		case 40, 41, 42, 43, 44, 45, 46, 47, 48, 49 -> "料金は3000円";
		case 50, 51, 52, 53, 54, 55, 56, 57, 58, 59 -> "料金は4000円";
		case 60, 61, 62, 63, 64, 65, 66, 67, 68, 69 -> "料金は4000円";
		case 70, 71, 72, 73, 74, 75, 76, 77, 78, 79 -> "料金は4000円";
		case 80, 81, 82, 83, 84, 85, 86, 87, 88, 89 -> "料金は5000円";
		default -> "料金は500円";
		};
		
		System.out.println(age + cost);
	}
}


/*
年代毎に料金が変わるサービスの料金表示
年代　int型　userAge 
料金　int型　serviceCost
10代	1000円 
20代	2000円
30代	3000円
40代	3000円
50代	4000円
60代	4000円
70代	4000円
80代	5000円
上記以外の年代	500円
変数宣言　初期化　条件分岐
*/

